//FJIsamStruct.h
//------------------------------------------------------------------------------
//	ISAMアクセスライブラリ内部利用構造体ヘッダ
//	Version 1.0		create date 2003/04/11
//	Version 1.2		Create Date 2006/03/01 .net 2.0 に作り変え
//	Copyright		藤井元雄
//------------------------------------------------------------------------------
//	Structs
//		rootChkPos_T	:ISAM再編成用二分木チェックポイント保存構造体
//------------------------------------------------------------------------------
#pragma once 
#include "Stdafx.h"

namespace FJIsam
{
//------------------------------------------------------------------------------
//  struct	:rootChkPos_T	:ISAM再編成用二分木チェックポイント保存構造体
//------------------------------------------------------------------------------
	struct rootChkPosT
	{
	UInt32 FrecNO;			//レコード番号
		Int64	FrecPos;		//レコード位置
		UInt32	FfirstRecNO;	//同一キー先頭レコード番号
		Int64	FfirstRecPos;	//同一キー先頭レコード位置
		UInt32	FlastRecNO;		//同一キー最後レコード番号
		Int64	FlastRecPos;	//同一キー最後レコード位置	
	};
}
